package org.chapter6.ex;


/*
    객체
    정의 - 실제로 존재하는 것
    용도 - 객체가 가지고 있는 기능과 속성에 따라 다름
    유형의 객체(책상, 자동차), 무형의 객체(수학공식, 프로그램 에러와 같은 논리나 개념)

    클래스
    정의 - 객체를 정의해놓은 것(객체의 틀)
    용도 - 객체를 생성하는데 사용

    ex) TV 설계도(클래스) <-> TV(객체),     붕어빵 기계(클래스) <-> 붕어빵(객쳬)
    => 클래스는 단지 객체를 생성하는데 사용될 뿐, 객체 그 자체는 아니다
    => 원하는 기능의 객체를 사욯하기 위해서는 먼저 클래스로부터 객체를 생성하는 과정이 선행되어야 한다
    => 클래스 작성 - 클래스로부터 객체 생성 (클래스로부터 객체를 만드는 과정 - 클래스의 인스턴스화)
        클래스로부터 만들어진 객체를 그 클래스의 "인스턴스"
        객체 - 모든 인스턴스를 대표하는 포괄적인 의미

   객체의 구성요소 - "속성", "기능"
   객체가 가지고 있는 속성과 기능을 그 객체의 "멤버"라 한다.
   속성(property) -> 멤버변수(variable)
   기능(function) -> 메서드(method)

   클래스란 객체를 정의한 것이므로 클래스에는 객체의 모든 속성과 기능이 정의되어 있다.
   클래스로부터 객체를 생성하면, 클래스에 정의된 속성과 기능을 가진 객체가 만들어진다.
   클래스 => 데이터 + 함수
 */

public class Ex6_ {

}
